noun = ["病患設定", "問診", "檢查", "診斷", "評分"]
section_name = ["config", "test", "examination", "diagnosis", "grade"]
icon = ["🩺", "📝", "🔬", "💊", "📚"]

intro = [
    ["歡迎 👋", "歡迎使用本系統", "請先完成病患設定並開始看診模擬", "在完成一區後可以選擇上一區閱讀紀錄"],
    ["開始問診", "在問診初步結束後，您可以利用檢查區進行進一步的檢查", "當你列出一些可能的疾病後，可按下完成問診以進入檢查區進一步分析", "在病患思考問題回答時請勿切換分頁"],
    ["開始檢查", "請選擇能夠鑑別病人疾病的檢查", "確認完所有資訊後按下確認進入最終診斷"],
    ["最終診斷", "請和病人交代你診斷的結果以及您的疾病診斷", "處此之外，請告訴病人您的處置"],
    ["評分區", "歡迎來到評分區", "考官會給予您的表現評價", "如有需要，可在下方和考官進行進一步討論"]
]

avatar_map = {
    "student": "⚕️",
    "patient": "😥", 
    "advisor": "🏫",
    "doctor": "⚕️",
    "grader": "🏫"
}

